#завантаження даних
x = c(1, 8, 2, 6, 3, 8, 5, 5, 5, 5)
x
#створення вектора з інтервалу [5; 6]
y<-x[x>=5 & x<=6]
y
#сума, добуток і різниця компонент
sum(y)
prod(y)
diff(y)
#вектор чисел від -15 до 100 що кратне 5
z<-seq(-15,100,by=5)
z
#заміна кожного числа що кратне 10 на 0
x<-replace(z,z%%10==0,c(0))
x
#виділення компонентів що більші за середнє значення
y<-x[x>mean(x)]
y
#сума компонент вектора
sum(y)
#вектор з парною кількістю елементів
vect<-c(-3,5,6,7,8,9,4,-4,-6,7,8,12,80,-5,0,6,21,-3,7,10)
#матриця з двома рядками
M1<-matrix(vect,nrow=2)
M1
#матриця з двома стовпцями
M2<-matrix(vect,ncol=2)
M2
#дані для A
vec <- numeric(18)
dim(vec)<-c(3,6)
A <- edit(vec)
A
#множення
A*A
#Введіть дані для вектора довжиною 12. Побудуйте з нього матрицю з трьох рядків і чотирьох стовпців . Транспонуйте матрицю В і позначте її через С. Позначте через D = BC .
vect1<-c(0,3,2,9,-5,6,0,5,7,3,-3,0)
B<-matrix(vect1,nrow = 3, ncol = 4, byrow = TRUE)
B
C<-t(B)
C
D<-B%*%C
D
A<-C%*%B
A
#Знайдіть матрицю, обернену до D, за допомогою функції
solve(D)
#Введіть квадратну матрицю порядку 4. Елементи головної діагоналі замініть на 0, якщо вони більші за середнє значення всіх елементів матриці.
vec <- numeric(16)
dim(vec)<-c(4,4)
A <- edit(vec)
A
diag(A)<-replace(diag(A), diag(A)> mean(A), c(0))
A
a<-c(0,3,-2)
y<-solve(A,a) #розв’язання лінійного рівняння.
y
#Запишіть вектор з 20 значень. Знайдіть його квартілі. Розбийте компонентивектора на 4 інтервали (межі – квартілі). Перетворіть вектор на фактор, де рівнями будуть інтервали, в які попадають значення вектора.
vect<-c(-3,5,6,7,8,9,4,-4,-6,7,8,12,80,-5,0,6,21,-3,7,10) #створення вектора
vect
g<-quantile(vect,c(0,0.25,0.5,0.75,1))
g
u<-cut(vect,breaks=g,labels=c('Перший','Другий', 'Третій', 'Четвертий'),include.lowest=TRUE)
u
#Введіть два вектора однакової довжини (наприклад, 15).
#Створити фактор, використавши ці два вектора.
vik<-c(21,18,76,35,72,29,45,67,43,23,25,87,45,24,25)
x<-sample(c(0,1),15,replace=TRUE)
x
mean(vik)
#З набору даних Loblolly вибрати стовпчики, які відповідають висоті і віку сосен.
#Утворити числовий вектор, який складається з середньої висоти дерева для таких
# категорій віку сосни: до 10 років, 10-15, 16-20, більше 20.
x<-c(mean(Loblolly$height[Loblolly$age<10]),mean(Loblolly$height[Loblolly$age>10&Loblolly$age<16]),mean(Loblolly$height[Loblolly$age>15&Loblolly$age<21]),mean(Loblolly$height[Loblolly$age>20]))
x
#З набору даних Loblolly вибрати тільки ті дані, які відповідають насінню типу
#301 і 315. Зеленою пунктирною лінією зобразити графік залежності висоти дерева
#для насіння 301 від віку сосни, а неперервною фіолетовою лінією – для насіння 315.
#Зобразити в одному вікні. Підписати рисунок.
h301<-Loblolly$height[Loblolly$Seed==301]
a301<-Loblolly$age[Loblolly$Seed==301]
a315<-Loblolly$age[Loblolly$Seed==315]
h315<-Loblolly$height[Loblolly$Seed==315]
plot(a301,h301,type='l',lty=5,col='green',ylab='Висота дерева', xlab="Вік дерева",main="Графік залежності висоти дерева від віку")
lines(a315,h315, add=T,col = "violet")
